{
	"interject":
	"I'd just like to interject for a moment. What you're referring to as Linux, is in fact, GNU/Linux, or as I've recently taken to calling it, GNU plus Linux. Linux is not an operating system unto itself, but rather another free component of a fully functioning GNU system made useful by the GNU corelibs, shell utilities and vital system components comprising a full OS as defined by POSIX.\n\nMany computer users run a modified version of the GNU system every day, without realizing it. Through a peculiar turn of events, the version of GNU which is widely used today is often called \"Linux\", and many of its users are not aware that it is basically the GNU system, developed by the GNU Project. There really is a Linux, and these people are using it, but it is just a part of the system they use.\n\nLinux is the kernel: the program in the system that allocates the machine's resources to the other programs that you run. The kernel is an essential part of an operating system, but useless by itself; it can only function in the context of a complete operating system. Linux is normally used in combination with the GNU operating system: the whole system is basically GNU with Linux added, or GNU/Linux. All the so-called \"Linux\" distributions are really distributions of GNU/Linux. ",
	"navyseal":
	"What the fuck did you just fucking say about me, you little proprietry bitch? I'll have you know I graduated top of my class in the FSF, and I've been involved in numerous secret raids on Apple patents, and I have over 300 confirmed bug fixes. I am trained in Free Software Evangelizing and I'm the top code contributer for the entire GNU HURD. You are nothing to me but just another compile time error. I will wipe you the fuck out with precision the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am building a GUI using GTK+ and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your life. You're fucking dead, kid. I can be anywhere, anytime, and I can decompile you in over seven hundred ways, and that's just with my Model M. Not only am I extensively trained in EMACS, but I have access to the entire arsenal of LISP functions and I will use it to its full extent to wipe your miserable ass off the face of the continent, you little shit. If only you could have known what unholy retribution your little \"clever\" comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn't, you didn't, and now you're paying the price, you goddamn idiot. I will shit Freedom all over you and you will drown in it. You're fucking debugged, kiddo.",
	"lecture":
	"A lamer Ubuntu-using script kiddie corporate shill professor was teaching a class on Mark Shuttleworth, known corporate spy and Linux ’programmer’.\n\n”Before the class begins, you must get on your knees and worship Shuttleworth and accept that he was the most highly-evolved programmer the world has ever known, even greater than Richard Stallman!”\n\nAt this moment, a brave, i3-using, bash scripting Poweruser who had over 1500 vertically-segmented Terminator windows and understood the necessity of systemd and fully supported all design decisions made by the Arch developers stood up and held up his sister’s netbook.\n\n”What’s this computer doing, pinhead?”\n\nThe arrogant professor smirked quite graphically and smugly replied “It’s clearly using apt-get to update Ubuntu with all the latest software.”\n\n”Wrong. It’s been 5,000 years since these packages were released. If it was actually installing the latest and best software, as you say… then it should be running Arch by now.”\n\nThe professor was visibly shaken, and dropped his Ubuntu phone and list of Amazon referral links. He stormed out of the room crying those shill corporate bloatware tears. There is no doubt that at this point our professor, Robbie Williamson, wished he had pulled himself up by his bootstraps and become more than a GNOME Unity user. He wished so much that he had a some privacy to shield himself from embarrassment, but he himself had sent his search history to Canonical’s servers!\n\nThe students applauded and all installed Arch that day and accepted Aaron Griffin as their lord and savior. An eagle named “linux-ck” flew into the room and perched atop the American Flag and shed a tear on the chalkboard. The ArchWiki was read several times, and Judd Vinet himself showed up and enacted a rolling release system across the country.\n\nThe professor lost his tenure and was fired the next day. His system experienced kernel panic and he was forced to reinstall Windows for all eternity.\n\nKISS.",
	"emojidelete":
	"SUDO I'M DELETING GNU+LINUX!:sob::wave::penguin:\n██]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]] 10% complete.....\n████]]]]]]]]]]]]]]]]]]]]]]]]]]] 35% complete....\n███████]]]]]]]]]]]]]]]] 60% complete....\n███████████] 99% complete.....\n:no_entry_sign:ERROR!:no_entry_sign:\n:100:True:100: open-source:unlock::open_file_folder: software is :gem:irreplaceable. :sparkling_heart:I could never delete :goat:GNU+Linux!:penguin::sparkling_heart:\nSend this to ten other :family::door:stall-men:door::family: who give you :money_with_wings::desktop:free software:money_with_wings::computer:, or never get called a :robot:hacker:robot: again:x::x::grimacing::grimacing::x::x:\nIf you get\n0 Back: you use proprietary BSD :no_entry_sign::no_entry_sign::imp:\n3 back: you're an Ubuntu user:cloud:️:sweat_drops:\n5 back: you're a kernel developer:kissing_cat::angel::skin-tone-5::sweat_drops:\n10+ back: Stallman!:stuck_out_tongue::stuck_out_tongue::two_hearts::two_hearts::sweat_drops::tongue::tongue:",
	"stfu":
	"Mauro, SHUT THE FUCK UP!\n\nIt's a bug alright - in the kernel. How long have you been a maintainer? And you *still* haven't learnt the first rule of kernel maintenance?\n\nIf a change results in user programs breaking, it's a bug in the kernel. We never EVER blame the user programs. How hard can this be to understand?\n\nTo make matters worse, commit f0ed2ce840b3 is clearly total and utter CRAP even if it didn't break applications. ENOENT is not a valid error return from an ioctl. Never has been, never will be. ENOENT means \"No such file and directory\", and is for path operations. ioctl's are done on files that have already been opened, there's no way in hell that ENOENT would ever be valid.\n\n> So, on a first glance, this doesn't sound like a regression,\n> but, instead, it looks tha pulseaudio/tumbleweed has some serious\n> bugs and/or regressions.\n\nShut up, Mauro. And I don't _ever_ want to hear that kind of obvious garbage and idiocy from a kernel maintainer again. Seriously.\n\n I'd wait for Rafael's patch to go through you, but I have another error report in my mailbox of all KDE media applications being broken by v3.8-rc1, and I bet it's the same kernel bug. And you've shown yourself to not be competent in this issue, so I'll apply it directly and immediately myself.\n\nWE DO NOT BREAK USERSPACE\n\nSeriously. How hard is this rule to understand? We particularly don't break user space with TOTAL CRAP. I'm angry, because your whole email was so _horribly_ wrong, and the patch that broke things was so obviously crap. The whole patch is incredibly broken shit. It adds an insane error code (ENOENT), and then because it's so insane, it adds a few places to fix it up (\"ret == -ENOENT ? -EINVAL : ret\").\nThe fact that you then try to make *excuses* for breaking user space, and blaming some external program that *used* to work, is just shameful. It's not how we work.\nFix your f*cking \"compliance tool\", because it is obviously broken.And fix your approach to kernel programming.",
	"gentoo":
	"https://files.charlesmilette.net/gentoo.gif",
	"systemd":
	"First off, systemd is not an init system, it has an init system as part of the systemd suite. systemd is a project to build a standardised lowlevel userland for Linux. The project is pretty comprehensive and it delivers a lot of functionality under one umbrella. It does away with a lot of older, often undermaintained software packages, which were traditionally used to assemble a low level userland.\nWhich is where the contention comes from, as a system suite systemd is restrictive for Unix virtuosi who are used to tailor a system with wit, ingenuity, a lick and a prayer and a couple dozen of unrelated packages. systemd makes such knowledge useless.\nThe faction that thinks that systemd is Linux's Hiroshima, finds all the added functionality bloat, unnecessary and dangerous, as it is all under development in one project.\nAll the systemd jokes stem from the comprehensiveness as a low level system suite. People against it love to joke that one day systemd will write its own kernel.\nThere is a lot of FUD and hate going around. Some arguments do have merit, a lot of eggs in one basket is certainly true, but as with all things in life, it depends which tradeoff you prefer. Do you want a suite of well designed software, working closely together, so that system management is streamlined or do you want the complete freedom to tailor your own low level system with a lot of time tested, interchangeable components.\nI have no desire to be a low level system designer, so I prefer systemd. I don't hate traditional init systems though. If a Linux system has one and I need to work with it, I'm still happy it boots and starts the necessary services.",
	"fossdating":
	"As a twenty year old single male I think it's very hard to find agirl who's actually interested in free software.\nI've had girls jokingly askto \"Netflix and chill\" but when I tell her that I don't use Netflix since Netflixrequires proprietary software to stream content, they stop talking to me. Andworse if they do stay they think I'm weird since I blocked google IP's in myhost file and we can't even watch youtube. I can't ever seem to get girls tocome over to my place and I can't text them either. Once I get their numberssince I've added customs roms to my phone and refuse to use sms since it's asecurity concern I require all of my friends to download a free and open sourcemessaging app and I share with them my public gpg key so that we can verifythat our conversations are secure. None of my friends are willing to do this.And I can't use sites like tinder since it's not only proprietary software buta major privacy vulnerability. How come it is so hard to find a girl concernedabout software freedom. I feel like I'm going to be a virgin forever.",
	"tymvfio":
	"VFIO tutorial by Tymscar: https://www.youtube.com/watch?v=6FI31QDtyy4",
	"google":
	"https://cdn.discordapp.com/attachments/305527416988893196/338691979560878080/Screenshot_20170723-164015_01.png",
	"stantrigger":
	"https://i.imgur.com/AsPUY53.gif"

}
